SpaceCapsule/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    wedge0
    {
        type            wedge;
        physicalType    wedge;
        nFaces          13432;
        startFace       19957;
    }
    vehicle
    {
        type            wall;
        physicalType    wall;
        nFaces          134;
        startFace       33389;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          25;
        startFace       33523;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          25;
        startFace       33548;
    }
    wedge1
    {
        type            wedge;
        physicalType    wedge;
        nFaces          13432;
        startFace       33573;
    }
    tunnel
    {
        type            slip;
        physicalType    slip;
        nFaces          50;
        startFace       47005;
    }
)

// ************************************************************************* //
